MixingTank/Test2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -0.22 -0.16  -0.22)
    (  0.22 -0.16  -0.22)
    (  0.22  0.50  -0.22)
    ( -0.22  0.50  -0.22)
    ( -0.22 -0.16   0.22)
    (  0.22 -0.16   0.22)
    (  0.22  0.50   0.22)
    ( -0.22  0.50   0.22)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (55 83 55) simpleGrading (1 1 1)
);

edges
(
);

boundary 
(
    allBoundary
    {
        type empty;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }

    outlet 
    {
        type patch;
        faces
        (
           (3 7 6 2) 
        );
    }
);

// ************************************************************************* //
