MixingTank/Test2/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

spargers                         // selector macro reused below
{
    timeStart       0;           // [s]
    duration        30;          // [s]
    selectionMode   cellZone;
    cellZone        spargerZone; // produced by topoSetDict
}

options
{
    massSource1
    {
        type            scalarSemiImplicitSource;
        $spargers;
        volumeMode      absolute;       // total rate for the whole zone
        injectionRateSuSp
        {
            thermo:rho.air (3.0e-4 0);  // kg/s  TOTAL
            // ⇒ change to 1.2e‑3 if you want 3e‑4 kg/s per sparger
        }
    }

    momentumSource1
    {
        type            vectorSemiImplicitSource;
        $spargers;
        volumeMode      absolute;
        injectionRateSuSp
        {
            U.air ((0 -1.0e-6 0) 0);
        }
    }

    energySource1
    {
        type            scalarSemiImplicitSource;
        $spargers;
        volumeMode      absolute;
        injectionRateSuSp
        {
            e.air (90 0);
        }
    }
}

// ************************************************************************* //
