MixingTank/Test2/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


actions
(
    //-------------------------------------------------------------------//
    //  build the four tiny cellSets (one per sparger)
    //-------------------------------------------------------------------//

    {
        name        injection1;
        type        cellSet;
        action      new;
        source      sphereToCell;
        sourceInfo
        {
            centre  (-0.020  -0.125  -0.020);
            radius  0.01;
        }
    }
    {
        name        injection2;
        type        cellSet;
        action      new;
        source      sphereToCell;
        sourceInfo
        {
            centre  ( 0.000  -0.125  -0.020);
            radius  0.01;
        }
    }
    {
        name        injection3;
        type        cellSet;
        action      new;
        source      sphereToCell;
        sourceInfo
        {
            centre  ( 0.020  -0.125  -0.020);
            radius  0.01;
        }
    }
    {
        name        injection4;
        type        cellSet;
        action      new;
        source      sphereToCell;
        sourceInfo
        {
            centre  ( 0.000  -0.125   0.020);
            radius  0.01;
        }
    }

    //-------------------------------------------------------------------//
    //  turn the 4 sets into ONE cellZone = spargerZone
    //-------------------------------------------------------------------//

    // first create / overwrite the zone with injection1
    {
        name        spargerZone;
        type        cellZoneSet;
        action      new;                    // overwrite if it exists
        source      setToCellZone;
        sourceInfo  { set injection1; }
    }

    // then ADD the three remaining cellSets
    {
        name        spargerZone;
        type        cellZoneSet;
        action      add;
        source      setToCellZone;
        sourceInfo  { set injection2; }
    }
    {
        name        spargerZone;
        type        cellZoneSet;
        action      add;
        source      setToCellZone;
        sourceInfo  { set injection3; }
    }
    {
        name        spargerZone;
        type        cellZoneSet;
        action      add;
        source      setToCellZone;
        sourceInfo  { set injection4; }
    }
);

// ************************************************************************* //
